---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ConduitSizeIterator
source: html/d7607991-c8de-5ad1-b615-24ec9c30d39d.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeIterator

An iterator to a set of conduit sizes from ConduitSizes.

## Syntax (C#)
```csharp
public class ConduitSizeIterator : IEnumerator<ConduitSize>
```